In [1]:
import numpy as np
import pandas as pd

In [2]:
'''
DataFrame basics
A few of the fundamental routines for selecting, sorting, adding and aggregating data in DataFrames
'''

data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3], 
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [4]:
df = pd.DataFrame(data, index=labels)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   animal    10 non-null     object
 1   age       8 non-null      float64
 2   visits    10 non-null     int64
 3   priority  10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 280.0+ bytes

In [6]:
df.describe() #Estadisticas

            age     visits
count  8.000000  10.000000
mean   3.437500   1.900000
std    2.007797   0.875595
min    0.500000   1.000000
25%    2.375000   1.000000
50%    3.000000   2.000000
75%    4.625000   2.750000
max    7.000000   3.000000

In [7]:
df.iloc[:3] #Devuelve los tres primeros
df.head(3) #Devuelve los tres primeros

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no

In [8]:
df[['animal', 'age']] #Selecciona las columnas Animal y Age

  animal  age
a    cat  2.5
b    cat  3.0
c  snake  0.5
d    dog  NaN
e    dog  5.0
f    cat  2.0
g  snake  4.5
h    cat  NaN
i    dog  7.0
j    dog  3.0

In [9]:
df.loc[df.index[[3, 4, 8]], ['animal', 'age']] #Selecciona 3,4,8 en las columnas animal y age

  animal  age
d    dog  NaN
e    dog  5.0
i    dog  7.0

In [10]:
df[df['visits'] >= 3] #Visitas mayor o igual de 3

  animal  age  visits priority
b    cat  3.0       3      yes
d    dog  NaN       3      yes
f    cat  2.0       3       no

In [11]:
df[df['age'].isnull()] #Donde la edad es nula

  animal  age  visits priority
d    dog  NaN       3      yes
h    cat  NaN       1      yes

In [12]:
df[(df['animal'] == 'cat') & (df['age'] < 3)] #Gato menor de 3 años

  animal  age  visits priority
a    cat  2.5       1      yes
f    cat  2.0       3       no

In [13]:
df[df['age'].between(2, 4)] #Edad entre 2 y 4

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
f    cat  2.0       3       no
j    dog  3.0       1       no

In [14]:
df.loc['f', 'age'] = 1.5 #Cambiar la edad de F a 1.5
print(df)

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  1.5       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [15]:
df['visits'].sum() #Suma de visitas

19

In [16]:
df.groupby('animal')['age'].mean() #Media de edad por animal

animal
cat      2.333333
dog      5.000000
snake    2.500000
Name: age, dtype: float64

In [17]:
df.loc['k'] = [5.5, 'dog', 'no', 2] #Añadir nuevo registro
print(df)
# and then deleting the new row...
df = df.drop('k')
print(df)

  animal  age visits priority
a    cat  2.5      1      yes
b    cat    3      3      yes
c  snake  0.5      2       no
d    dog  NaN      3      yes
e    dog    5      2       no
f    cat  1.5      3       no
g  snake  4.5      1       no
h    cat  NaN      1      yes
i    dog    7      2       no
j    dog    3      1       no
k    5.5  dog     no        2
  animal  age visits priority
a    cat  2.5      1      yes
b    cat    3      3      yes
c  snake  0.5      2       no
d    dog  NaN      3      yes
e    dog    5      2       no
f    cat  1.5      3       no
g  snake  4.5      1       no
h    cat  NaN      1      yes
i    dog    7      2       no
j    dog    3      1       no

In [18]:
df['animal'].value_counts() #contar animales

cat      4
dog      4
snake    2
Name: animal, dtype: int64

In [19]:
df.sort_values(by=['age', 'visits'], ascending=[False, True]) #Ordenar valores

  animal  age visits priority
i    dog    7      2       no
e    dog    5      2       no
g  snake  4.5      1       no
j    dog    3      1       no
b    cat    3      3      yes
a    cat  2.5      1      yes
f    cat  1.5      3       no
c  snake  0.5      2       no
h    cat  NaN      1      yes
d    dog  NaN      3      yes

In [20]:
'''
The 'priority' column contains the values 'yes' and 'no'. 
Replace this column with a column of boolean values: 'yes' should be True and 'no' should be False
'''

df['priority'] = df['priority'].replace({'yes': True, 'no': False})
print(df)

  animal  age visits  priority
a    cat  2.5      1      True
b    cat    3      3      True
c  snake  0.5      2     False
d    dog  NaN      3      True
e    dog    5      2     False
f    cat  1.5      3     False
g  snake  4.5      1     False
h    cat  NaN      1      True
i    dog    7      2     False
j    dog    3      1     False

In [27]:
'''
In the 'animal' column, change the 'snake' entries to 'python'.
'''

df['animal'] = df['animal'].replace('snake', 'python')
print(df)

   animal  age visits  priority
a     cat  2.5      1      True
b     cat  3.0      3      True
c  python  0.5      2     False
d     dog  NaN      3      True
e     dog  5.0      2     False
f     cat  1.5      3     False
g  python  4.5      1     False
h     cat  NaN      1      True
i     dog  7.0      2     False
j     dog  3.0      1     False

In [29]:
'''
For each animal type and each number of visits, find the mean age. 
In other words, each row is an animal, each column is a number of visits and the values are the
mean ages (hint: use a pivot table).
'''

d = df.pivot_table(index='animal', columns='visits', values='age', aggfunc='mean', fill_value=0)
print(d)

visits    1    2     3
animal
cat     2.5  0.0  2.25
dog     3.0  6.0  0.00
python  4.5  0.5  0.00

In [30]:
'''
DataFrames: beyond the basics
Slightly trickier: you may need to combine two or more methods to get the right answer

You have a DataFramedfwith a column 'A' of integers. For example:
'''

df_2 = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})

In [32]:
df_2.loc[df_2['A'].shift() != df_2['A']]

   A
0  1
1  2
3  3
4  4
5  5
8  6
9  7

In [33]:
df_2.drop_duplicates(subset='A')

   A
0  1
1  2
3  3
4  4
5  5
8  6
9  7

In [38]:
# Given a DataFrame of random numeric values:

df_2 = pd.DataFrame(np.random.random(size=(5, 3)))
print(df_2)

          0         1         2
0  0.039819  0.811678  0.575533
1  0.267049  0.519422  0.684603
2  0.882344  0.632323  0.883321
3  0.454861  0.272566  0.062206
4  0.968027  0.528592  0.276098

In [39]:
df_2.sub(df.mean(axis=1), axis=0)

    0   1   2
0 NaN NaN NaN
1 NaN NaN NaN
2 NaN NaN NaN
3 NaN NaN NaN
4 NaN NaN NaN
a NaN NaN NaN
b NaN NaN NaN
c NaN NaN NaN
d NaN NaN NaN
e NaN NaN NaN
f NaN NaN NaN
g NaN NaN NaN
h NaN NaN NaN
i NaN NaN NaN
j NaN NaN NaN

In [41]:
'''
Suppose you have DataFrame with 10 columns of real numbers, for example:
'''

df_2 = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))
print(df_2)

          a         b         c         d         e         f         g  \
0  0.937664  0.509278  0.072794  0.847063  0.855831  0.580848  0.279658
1  0.076247  0.014945  0.026649  0.815193  0.584995  0.010261  0.868370
2  0.216711  0.445897  0.449742  0.881031  0.141494  0.848511  0.449452
3  0.420657  0.306413  0.085355  0.807287  0.791882  0.917313  0.471802
4  0.125560  0.780853  0.236924  0.202012  0.189137  0.170449  0.281043

          h         i         j
0  0.751466  0.503978  0.578997
1  0.596735  0.297714  0.432209
2  0.024554  0.744081  0.007944
3  0.272289  0.470520  0.190889
4  0.919973  0.856468  0.616736

In [42]:
'''
Which column of numbers has the smallest sum? Return that column's label
'''

df_2.sum().idxmin()

'c'

In [44]:
'''
How do you count how many unique rows a DataFrame has (i.e. ignore all rows that are duplicates)?
'''

df_2 = pd.DataFrame(np.random.randint(0, 2, size=(10, 3)))
# or perhaps more simply...
len(df_2.drop_duplicates(keep=False))
print(df_2)

   0  1  2
0  1  0  0
1  1  0  0
2  0  1  1
3  1  0  0
4  1  1  1
5  1  1  0
6  0  0  1
7  0  0  0
8  1  0  0
9  1  0  0

In [47]:
'''
In the cell below, you have a DataFramedfthat consists of 10 columns of floating-point numbers.
Exactly 5 entries in each row are NaN values.For each row of the DataFrame, find thecolumn which
contains thethirdNaN value.You should return a Series of column labels:e,c,d,h,d
'''

nan = np.nan
data = [[0.04, nan, nan, 0.25, nan, 0.43, 0.71, 0.51, nan, nan],
        [ nan, nan, nan, 0.04, 0.76, nan, nan, 0.67, 0.76, 0.16],
        [ nan, nan, 0.5 , nan, 0.31, 0.4 , nan, nan, 0.24, 0.01],
        [0.49, nan, nan, 0.62, 0.73, 0.26, 0.85, nan, nan, nan],
        [ nan, nan, 0.41, nan, 0.05, nan, 0.61, nan, 0.48, 0.68]]

columns = list('abcdefghij')
df_3 = pd.DataFrame(data, columns=columns)
(df_3.isnull().cumsum(axis=1) == 3).idxmax(axis=1)
print(df_3)

      a   b     c     d     e     f     g     h     i     j
0  0.04 NaN   NaN  0.25   NaN  0.43  0.71  0.51   NaN   NaN
1   NaN NaN   NaN  0.04  0.76   NaN   NaN  0.67  0.76  0.16
2   NaN NaN  0.50   NaN  0.31  0.40   NaN   NaN  0.24  0.01
3  0.49 NaN   NaN  0.62  0.73  0.26  0.85   NaN   NaN   NaN
4   NaN NaN  0.41   NaN  0.05   NaN  0.61   NaN  0.48  0.68

In [49]:
'''
A DataFrame has a column of groups 'grps' and and column of integer values 'vals':
'''

df_4 = pd.DataFrame({'grps': list('aaabbcaabcccbbc'),
                   'vals': [12,345,3,1,45,14,4,52,54,23,235,21,57,3,87]})
print(df_4)

   grps  vals
0     a    12
1     a   345
2     a     3
3     b     1
4     b    45
5     c    14
6     a     4
7     a    52
8     b    54
9     c    23
10    c   235
11    c    21
12    b    57
13    b     3
14    c    87

In [50]:
# For each group, find the sum of the three greatest values. You should end up with the answer as follows:
df_4 = pd.DataFrame({'grps': list('aaabbcaabcccbbc'),
                     'vals': [12,345,3,1,45,14,4,52,54,23,235,21,57,3,87]})
df_4.groupby('grps')['vals'].nlargest(3).sum(level=0)

print(df_4)

   grps  vals
0     a    12
1     a   345
2     a     3
3     b     1
4     b    45
5     c    14
6     a     4
7     a    52
8     b    54
9     c    23
10    c   235
11    c    21
12    b    57
13    b     3
14    c    87

In [54]:
'''
Consider a DataFramedfwhere there is an integer column 'X'
'''

df_5 = pd.DataFrame({'X': [7, 2, 0, 3, 4, 2, 5, 0, 3, 4]})

izero = np.r_[-1, (df_5 == 0).values.nonzero()[0]] # indices of zeros
idx = np.arange(len(df_5))
y = df_5['X'] != 0
df_5['Y'] = idx - izero[np.searchsorted(izero - 1, idx) - 1]

print(df_5)

   X  Y
0  7  1
1  2  2
2  0  0
3  3  1
4  4  2
5  2  3
6  5  4
7  0  0
8  3  1
9  4  2

In [56]:
'''
Create a list of the column-row index locations of the 3 largest values in this DataFrame. 
In this case, the answer should be:
'''
df = pd.DataFrame(np.random.RandomState(30).randint(1, 101, size=(8, 8)))
df.unstack().sort_values()[-3:].index.tolist()
print(df)

    0   1   2   3   4   5   6   7
0  38  38  46  46  13  24   3  54
1  18  47   4  42   8  66  50  46
2  62  36  19  19  77  17   7  63
3  28  47  46  65  63  12  16  24
4  14  51  34  56  29  59  92  79
5  58  76  96  45  38  76  58  40
6  10  34  48  40  37  23  41  26
7  55  70  91  27  79  92  20  31

In [64]:
'''You are given the DataFrame below with a column of group IDs, 'grps', and a column of corresponding
integer values, 'vals'.
'''
df = pd.DataFrame({"vals": np.random.RandomState(31).randint(-30, 30, size=15), 
                   "grps": np.random.RandomState(31).choice(["A", "B"], 15)})

print(df)

    vals grps
0    -12    A
1     -7    B
2    -14    A
3      4    A
4     -7    A
5     28    B
6     -2    A
7     -1    A
8      8    A
9     -2    B
10    28    A
11    12    A
12    16    A
13   -24    A
14   -12    A

In [65]:
df = pd.DataFrame({"vals": np.random.RandomState(31).randint(-30, 30, size=15),
                   "grps": np.random.RandomState(31).choice(["A", "B"], 15)})
def replace(group):
    mask = group<0
    group[mask] = group[~mask].mean()
    return group
df.groupby(['grps'])['vals'].transform(replace)

print(df)

    vals grps
0    -12    A
1     -7    B
2    -14    A
3      4    A
4     -7    A
5     28    B
6     -2    A
7     -1    A
8      8    A
9     -2    B
10    28    A
11    12    A
12    16    A
13   -24    A
14   -12    A

In [66]:
'''
Implement a rolling mean over groups with window size 3, which ignores NaN value. 
For example consider the following DataFrame:
'''

df = pd.DataFrame({'group': list('aabbabbbabab'), 
                   'value': [1, 2, 3, np.nan, 2, 3, np.nan, 1, 7, 3, np.nan, 8]})

print(df)

   group  value
0      a    1.0
1      a    2.0
2      b    3.0
3      b    NaN
4      a    2.0
5      b    3.0
6      b    NaN
7      b    1.0
8      a    7.0
9      b    3.0
10     a    NaN
11     b    8.0

In [67]:
'''
E.g. the first window of size three for group 'b' has values 3.0, NaN and 3.0 and occurs at 
row index 5. Instead of being NaN the value in the new column at this row index should be 3.0
(just the two non-NaN values are used to compute the mean (3+3)/2)
'''

df = pd.DataFrame({'group': list('aabbabbbabab'),
'value': [1, 2, 3, np.nan, 2, 3, np.nan, 1, 7, 3, np.nan, 8]})
g1 = df.groupby(['group'])['value'] # group values
g2 = df.fillna(0).groupby(['group'])['value'] # fillna, then group values
s = g2.rolling(3, min_periods=1).sum() / g1.rolling(3, min_periods=1).count() # compute means
s.reset_index(level=0, drop=True).sort_index()

0     1.000000
1     1.500000
2     3.000000
3     3.000000
4     1.666667
5     3.000000
6     3.000000
7     2.000000
8     3.666667
9     2.000000
10    4.500000
11    4.000000
Name: value, dtype: float64

In [68]:
'''
Create a DatetimeIndex that contains each business day of 2015 and use it to index a Series
of random numbers. Let's call thisSeriess.
'''

dti = pd.date_range(start='2015-01-01', end='2015-12-31', freq='B')
s = pd.Series(np.random.rand(len(dti)), index=dti)
print(s)

2015-01-01    0.592082
2015-01-02    0.091474
2015-01-05    0.971857
2015-01-06    0.921453
2015-01-07    0.237295
                ...
2015-12-25    0.199323
2015-12-28    0.607060
2015-12-29    0.933918
2015-12-30    0.096380
2015-12-31    0.510768
Freq: B, Length: 261, dtype: float64

In [69]:
#Find the sum of the values insfor every Wednesday
s[s.index.weekday == 2].sum()

24.593877954446125

In [70]:
#For eachcalendar month ins, find the mean of values
s.resample('M').mean()

2015-01-31    0.563358
2015-02-28    0.530541
2015-03-31    0.537602
2015-04-30    0.504660
2015-05-31    0.456270
2015-06-30    0.460443
2015-07-31    0.508837
2015-08-31    0.462558
2015-09-30    0.429944
2015-10-31    0.494048
2015-11-30    0.611913
2015-12-31    0.484155
Freq: M, dtype: float64

In [71]:
'''For  each  group  of  four  consecutive  calendar  months  ins,  find  the  date  on  which
the highest value occurred.
'''

s.groupby(pd.Grouper(freq='4M')).idxmax()

2015-01-31   2015-01-05
2015-05-31   2015-02-17
2015-09-30   2015-08-17
2016-01-31   2015-11-16
Freq: 4M, dtype: datetime64[ns]

In [72]:
'''
Create  a DateTimeIndex  consisting  of  the  third  Thursday  in  each  month  for  the  years 2015 and 2016.
'''

pd.date_range('2015-01-01', '2016-12-31', freq='WOM-3THU')

DatetimeIndex(['2015-01-15', '2015-02-19', '2015-03-19', '2015-04-16',
               '2015-05-21', '2015-06-18', '2015-07-16', '2015-08-20',
               '2015-09-17', '2015-10-15', '2015-11-19', '2015-12-17',
               '2016-01-21', '2016-02-18', '2016-03-17', '2016-04-21',
               '2016-05-19', '2016-06-16', '2016-07-21', '2016-08-18',
               '2016-09-15', '2016-10-20', '2016-11-17', '2016-12-15'],
              dtype='datetime64[ns]', freq='WOM-3THU')

In [73]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 'Budapest_PaRis', 'Brussels_londOn'], 
                   'FlightNumber': [10045, np.nan, 10065, np.nan, 10085], 
                   'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]], 
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', '12. Air France', '"Swiss Air"']})
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [74]:
'''
TheFrom_Tocolumn would be better as two separate columns! Split each string on the underscore  delimiter_to
give  a  new  temporary  DataFrame  called  'temp'  with  the  correct values. Assign the correct column
names 'From' and 'To' to this temporary DataFrame.
'''

temp = df.From_To.str.split('_', expand=True)
temp.columns = ['From', 'To']
temp

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

In [75]:
'''
Notice  how  the  capitalisation  of  the  city  names  is  all  mixed  up  in  this  temporary DataFrame
'temp'.  Standardise  the  strings  so  that  only  the  first  letter  is uppercase  (e.g. "londON" should
become "London".)
'''

temp['From'] = temp['From'].str.capitalize()
temp['To'] = temp['To'].str.capitalize()
temp

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

In [76]:
'''
Delete  the  From_To  column  from41. Delete  theFrom_Tocolumn  fromdfand  attach the temporary DataFrame
'temp' from the previous questions.dfand attach the temporary DataFrame from the previous questions
'''

df = df.drop('From_To', axis=1)
df = df.join(temp)
df

   FlightNumber  RecentDelays              Airline      From         To
0       10045.0      [23, 47]               KLM(!)    London      Paris
1           NaN            []    <Air France> (12)    Madrid      Milan
2       10065.0  [24, 43, 87]  (British Airways. )    London  Stockholm
3           NaN          [13]       12. Air France  Budapest      Paris
4       10085.0      [67, 32]          "Swiss Air"  Brussels     London

In [78]:
'''
In theAirlinecolumn, you can see some extra puctuationand symbols have appeared around  the  airline  names.
Pull  out  just  the  airline  name.  E.g.'(BritishAirways.)'should become'BritishAirways'.
'''

df['Airline'] = df['Airline'].str.extract('([a-zA-Z\s]+)', expand=False).str.strip()
df

   FlightNumber  RecentDelays          Airline      From         To
0       10045.0      [23, 47]              KLM    London      Paris
1           NaN            []       Air France    Madrid      Milan
2       10065.0  [24, 43, 87]  British Airways    London  Stockholm
3           NaN          [13]       Air France  Budapest      Paris
4       10085.0      [67, 32]        Swiss Air  Brussels     London

In [79]:
'''
In theRecentDelayscolumn, the values have been entered into the DataFrame as a list. 
We would like each first value in its own column, each second value in its own column, and so on. 
If there isn't an Nth value, the value should be NaN.Expand  the  Series  of  lists  into  a  new  DataFrame
named  'delays',  rename  the  columns 'delay_1', 'delay_2', etc. and replace the unwanted RecentDelays column
indfwith 'delays'.
'''

delays = df['RecentDelays'].apply(pd.Series)
delays.columns = ['delay_{}'.format(n) for n in range(1, len(delays.columns)+1)]
df = df.drop('RecentDelays', axis=1).join(delays)

df

,FlightNumber,Airline,From,To,delay_1,delay_2,delay_3
0,10045.0,KLM,London,Paris,23.0,47.0,NaN
1,NaN,Air France,Madrid,Milan,NaN,NaN,NaN
2,10065.0,British Airways,London,Stockholm,24.0,43.0,87.0
3,NaN,Air France,Budapest,Paris,13.0,NaN,NaN
4,10085.0,Swiss Air,Brussels,London,67.0,32.0,NaN

In [81]:
'''
Given the listsletters=['A','B','C']andnumbers=list(range(10)), construct  a  MultiIndex  object  from  the
product  of  the  two  lists.  Use  it  to  index  a  Series  of random numbers. Call this Series s.
'''

letters = ['A', 'B', 'C']
numbers = list(range(10))

mi = pd.MultiIndex.from_product([letters, numbers])
s = pd.Series(np.random.rand(30), index=mi)
s

A  0    0.150111
   1    0.948942
   2    0.994937
   3    0.119945
   4    0.682746
   5    0.309200
   6    0.078731
   7    0.364763
   8    0.644291
   9    0.769916
B  0    0.381221
   1    0.381979
   2    0.565411
   3    0.517552
   4    0.620406
   5    0.714132
   6    0.137495
   7    0.081503
   8    0.118016
   9    0.646239
C  0    0.927788
   1    0.094508
   2    0.233040
   3    0.039408
   4    0.069564
   5    0.461225
   6    0.802197
   7    0.174574
   8    0.975185
   9    0.399413
dtype: float64

In [84]:
'''
Check the index of sis lexicographically sorted (this is a necessary proprty for indexing to work correctly
with a MultiIndex).
'''
s.index.is_lexsorted()

True

In [85]:
#Select the labels1,3and6from the second level of the MultiIndexed Series.

s.loc[:, [1, 3, 6]]

A  1    0.948942
   3    0.119945
   6    0.078731
B  1    0.381979
   3    0.517552
   6    0.137495
C  1    0.094508
   3    0.039408
   6    0.802197
dtype: float64

In [86]:
#Slice the Seriess; slice up to label 'B' for the first level and from label 5 onwards for the second level.
s.loc[pd.IndexSlice[:'B', 5:]]

A  5    0.309200
   6    0.078731
   7    0.364763
   8    0.644291
   9    0.769916
B  5    0.714132
   6    0.137495
   7    0.081503
   8    0.118016
   9    0.646239
dtype: float64

In [87]:
#Sum the values insfor each label in the first level (you should have Series giving you a total for labels A, B and C).
s.sum(level=0)

A    5.063584
B    4.163954
C    4.176902
dtype: float64

In [88]:
'''
Suppose  thatsum()(and  other  methods)  did  not  accept  alevelkeyword  argument. 
How else could you perform the equivalent ofs.sum(level=1)?
'''

s.unstack().sum(axis=0)

0    1.459120
1    1.425429
2    1.793389
3    0.676906
4    1.372716
5    1.484557
6    1.018423
7    0.620840
8    1.737492
9    1.815568
dtype: float64

In [89]:
'''
Exchange the levels of the MultiIndex so we have an index of the form (letters, numbers). 
Is this new Series properly lexsorted? If not, sort it
'''

new_s = s.swaplevel(0, 1)
if not new_s.index.is_lexsorted():
    new_s = new_s.sort_index()
new_s

0  A    0.150111
   B    0.381221
   C    0.927788
1  A    0.948942
   B    0.381979
   C    0.094508
2  A    0.994937
   B    0.565411
   C    0.233040
3  A    0.119945
   B    0.517552
   C    0.039408
4  A    0.682746
   B    0.620406
   C    0.069564
5  A    0.309200
   B    0.714132
   C    0.461225
6  A    0.078731
   B    0.137495
   C    0.802197
7  A    0.364763
   B    0.081503
   C    0.174574
8  A    0.644291
   B    0.118016
   C    0.975185
9  A    0.769916
   B    0.646239
   C    0.399413
dtype: float64